[
  {
    "project": "Amway Creators+",
    "url": "https://play.google.com/store/apps/details?id=com.amway.global.creators&hl=en",
    "repo": "Google Play",
    "descriptionTitle": "The Amway Creators+",
    "description": "<p>The ABO-oriented Amway app incorporates cutting-edge technologies and a comprehensive feature set tailored specifically for ABOs. With a robust tech stack including Jetpack Compose UI, Kotlin Coroutines, and Firebase functionalities, the app provides seamless user experiences and powerful business growth tools. It's a testament to modern mobile development, meticulously designed to meet the diverse needs of ABOs globally.</p><p>As the lead developer, my role extends beyond coding tasks to orchestrate effective collaboration among stakeholders. From clients to QA teams, I ensure that every feature aligns with user requirements and industry best practices. By maintaining strict code quality standards and fostering open communication channels, I drive the continual evolution of the Amway app, empowering ABOs to thrive in their endeavors.</p>",
    "imageOptions": [],
    "images": [
      {
        "key": "mock-stack",
        "hover": "left",
        "h": "96",
        "w": "279",
        "url": "/img/amway-seeklogo.png"
      }
    ],
    "stack": [
      { "key": "brightcove", "name": "Brightcove", "type": "far" },
      { "key": "kotlin", "name": "Kotlin", "type": "devicon" },
      { "key": "jetpackcompose", "name": "Jetpack Compose", "type": "devicon" },
      { "key": "graphql", "name": "Graphql", "type": "devicon" }
    ]
  },
  {
    "project": "Chopt Salad: Android App POC",
    "url": "https://play.google.com/store/apps/details?id=com.choptsalad.choptsalad.android.app&hl=en",
    "repo": "Google Play",
    "descriptionTitle": "POC app",
    "description": "<p>We recently secured the Chopt salad project after developing a proof-of-concept (POC) app that impressed the client. Our app boasts intricate UX and animations meticulously crafted by our talented design team. The primary goal is to deliver an exceptional user experience, focusing on intuitive navigation, captivating animations, and seamless interactions.</p><p>The app's success in winning the client's approval underscores the effectiveness of our design and development strategy. We take pride in delivering a solution that not only meets but exceeds the client's expectations, highlighting our proficiency in creating engaging UX and animations.</p>",
    "imageOptions": [{ "key": "size", "value": "large" }],
    "images": [
      {
        "key": "portfolio",
        "hover": "right",
        "h": "50",
        "w": "513",
        "url": "/img/chopt-log-r.png"
      }
    ],
    "stack": [
      { "key": "kotlin", "name": "Kotlin", "type": "devicon" },
      { "key": "figma", "name": "Figma", "type": "devicon" },
      { "key": "postman", "name": "Postman", "type": "devicon" }
    ]
  },
  {
    "project": "CPK (California Pizza Kitchen)",
    "url": "https://yml.co/project/california-pizza-kitchen",
    "repo": "Google Play",
    "descriptionTitle": "CPK",
    "description": "<p>We developed and won the client pitch for this high-paced POC, aligning it with the design and UX provided by our talented design team. The project was executed swiftly, ensuring a seamless match to the intricate design elements. Effective communication and collaboration were prioritized to meet the client's expectations.</p><p>Our success in securing the project victory is a testament to our team's expertise and commitment to excellence. The POC showcases our ability to translate the design team's vision into a functional and visually impressive app.</p>",
    "imageOptions": [],
    "images": [
      {
        "key": "mock-stack",
        "hover": "left",
        "h": "63",
        "svg": true,
        "w": "150",
        "durl": "/img/cpk-light.png",
        "lurl": "/img/cpk-logo-resizefin.png"
      }
    ],
    "stack": [{ "key": "kotlin", "name": "Kotlin", "type": "devicon" }]
  },
  {
    "project": "LastSeat",
    "url": "https://lastseatapp.com/",
    "repo": "Google Play",
    "descriptionTitle": "LastSeat",
    "description": "<p>I collaborated closely with a senior developer to bring LastSeat, a flight booking app, to life. Together, we handled every aspect of the project, from conceptualization to implementation. LastSeat stands as a comprehensive platform, offering users seamless flight booking experiences through its intuitive features and user-friendly interface.</p><p>Throughout the development journey, my senior colleague and I combined our skills to ensure LastSeat's success. From integrating APIs for flight data to implementing secure payment processing, we focused on delivering robust functionality. Building LastSeat from scratch was both thrilling and fulfilling, as we prioritized industry standards, user feedback, and the latest technologies to create a reliable and efficient flight booking solution.</p>",
    "imageOptions": [{ "key": "size", "value": "large" }],
    "images": [
      {
        "key": "portfolio",
        "hover": "right",
        "h": "50",
        "w": "181",
        "durl": "/img/lastseat-logo-resize.svg",
        "lurl": "/img/l-s.svg"
      }
    ],
    "stack": [{ "key": "kotlin", "name": "Kotlin", "type": "devicon" }]
  },
  {
    "project": "MLBPA",
    "url": "https://play.google.com/store/apps/details?id=com.icreon.mlbpa&hl=vi",
    "repo": "Google Play",
    "descriptionTitle": "MLBPA",
    "description": "<p>The MLBPA app offers a centralized hub for PA announcements, news, updates, and collective bargaining information pertinent to the MLBPA. Users can conveniently log in with their existing MLBPA accounts, accessing real-time updates and licensing frameworks effortlessly.</p><p>As an individual developer, I focused on refining specific aspects of the application, leveraging my expertise to enhance functionality and user experience. Through collaboration with the team, I ensured that my contributions complemented the overarching project goals, ultimately creating a valuable resource for users seeking current and relevant PA-related content.</p>",
    "imageOptions": [],
    "images": [
      {
        "key": "mock-stack",
        "hover": "left",
        "h": "3",
        "w": "4",
        "lurl": "/img/mlbp-d.png",
        "durl": "/img/mlb-l.png",
        "url": "/img/mlb-l.png"
      }
    ],
    "stack": [
      { "key": "kotlin", "name": "Kotlin", "type": "devicon" },
      { "key": "materialui", "name": "Material UI", "type": "devicon" }
    ]
  },
  {
    "project": "Mosomo",
    "url": "https://play.google.com/store/apps/details?id=com.workzone&hl=ar",
    "repo": "Google Play",
    "descriptionTitle": "Mosomo",
    "description": "<p>Teaming up with a senior developer, we spearheaded the development of the Mosomo app from inception to completion. Our collaboration spanned the entire app development lifecycle, from planning and design to implementation and testing. With a focus on high-quality code and best practices, we ensured that the app met the highest standards of excellence.</p><p>Working alongside a seasoned professional provided invaluable learning opportunities and insights. Together, we crafted a robust and feature-rich app that not only meets but exceeds the expectations of our users, reflecting our commitment to delivering top-notch solutions.</p>",
    "imageOptions": [{ "key": "size", "value": "large" }],
    "images": [
      {
        "key": "portfolio",
        "hover": "right",
        "h": "152",
        "w": "312",
        "url": "/img/mosomo-log-resize.png"
      }
    ],
    "stack": [
      { "key": "java", "name": "java", "type": "devicon" },
      { "key": "json", "name": "json", "type": "devicon" },
      { "key": "sqlite", "name": "sqlite", "type": "devicon" },
      { "key": "androidstudio", "name": "android studio", "type": "devicon" }
    ]
  },
  {
    "project": "Sushi Crush",
    "url": "https://play.google.com/store/apps/details?id=ac.sushi_crush&hl=en",
    "repo": "Google Play",
    "descriptionTitle": "Sushi Crush",
    "description": "<p>An innovative mobile app, specializes in the seamless delivery of expertly crafted sushi platters. Utilizing advanced ordering and delivery functionalities, users can enjoy a superior culinary experience with the freshest sushi brought directly to their doorsteps. The app combines precision in delivery logistics with a user-friendly interface, providing a technically advanced solution for sushi enthusiasts.</p><p>In the Sudhi Crush project, I contributed to code refactoring, introduced new features, and optimized the existing codebase. The focus was on enhancing the overall performance and user experience of the app.</p>",
    "imageOptions": [],
    "images": [
      {
        "key": "mock-stack",
        "hover": "left",
        "h": "88",
        "w": "136",
        "durl": "/img/logo_sushi_white_.png",
        "lurl": "/img/sushi_logo.png"
      }
    ],
    "stack": [
      { "key": "java", "name": "java", "type": "devicon" },
      { "key": "androidstudio", "name": "android studio", "type": "devicon" }
    ]
  }
]
